## Plan Result (635: prod_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 58 to change, 10 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;SDS-Prod&#34;]
* Update
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_storage_container.sc
* Delete
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CP-COPILOT-BETA"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c219653994d226d9eab74sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c219653994d226d9eab74sa"
      - storage_account_name              = "c219653994d226d9eab74sa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cef8dd15315775bcde240sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa"
      - storage_account_name              = "cef8dd15315775bcde240sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c58a2ce36d164aa559c68sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c58a2ce36d164aa559c68sa"
      - storage_account_name              = "c58a2ce36d164aa559c68sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cbf308a5c8dca9fd43783sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/cbf308a5c8dca9fd43783sa"
      - storage_account_name              = "cbf308a5c8dca9fd43783sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c4bb049c89ee45375cc18sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c4bb049c89ee45375cc18sa"
      - storage_account_name              = "c4bb049c89ee45375cc18sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cd025feceb649d3ff2060sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-demo-rg/providers/Microsoft.Storage/storageAccounts/cd025feceb649d3ff2060sa"
      - storage_account_name              = "cd025feceb649d3ff2060sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c8b6ea9226056e1c9b9a4sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c8b6ea9226056e1c9b9a4sa"
      - storage_account_name              = "c8b6ea9226056e1c9b9a4sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c62864d440cf33942fa09sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-ithc-rg/providers/Microsoft.Storage/storageAccounts/c62864d440cf33942fa09sa"
      - storage_account_name              = "c62864d440cf33942fa09sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c8cbc6f36739db5d00b27sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c8cbc6f36739db5d00b27sa"
      - storage_account_name              = "c8cbc6f36739db5d00b27sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cb72ab7b703b0f2c6a1bbsa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/cb72ab7b703b0f2c6a1bbsa"
      - storage_account_name              = "cb72ab7b703b0f2c6a1bbsa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c96c274ced528432298a7sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/c96c274ced528432298a7sa"
      - storage_account_name              = "c96c274ced528432298a7sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c8a07fdcdff737a4b9e3csa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-test-rg/providers/Microsoft.Storage/storageAccounts/c8a07fdcdff737a4b9e3csa"
      - storage_account_name              = "c8a07fdcdff737a4b9e3csa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cdbd3a97b4e86f6f23d25sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-demo-rg/providers/Microsoft.Storage/storageAccounts/cdbd3a97b4e86f6f23d25sa"
      - storage_account_name              = "cdbd3a97b4e86f6f23d25sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c1c4f0704b90c34ef14c9sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c1c4f0704b90c34ef14c9sa"
      - storage_account_name              = "c1c4f0704b90c34ef14c9sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c8999dec36588559729d1sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c8999dec36588559729d1sa"
      - storage_account_name              = "c8999dec36588559729d1sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CNP-QA"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c7a4e3bd52188fee3ff1csa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-test-rg/providers/Microsoft.Storage/storageAccounts/c7a4e3bd52188fee3ff1csa"
      - storage_account_name              = "c7a4e3bd52188fee3ff1csa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-RDO-Development"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cfa397675bc7df0e51bf4sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cfa397675bc7df0e51bf4sa"
      - storage_account_name              = "cfa397675bc7df0e51bf4sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-RDO-Production"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c00b9a00a468e00836a33sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c00b9a00a468e00836a33sa"
      - storage_account_name              = "c00b9a00a468e00836a33sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c6fe2c66c95ac3fb8966fsa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c6fe2c66c95ac3fb8966fsa"
      - storage_account_name              = "c6fe2c66c95ac3fb8966fsa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-ROBOTICS-SBOX"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://ccdc31e8e635e954c27d3sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/ccdc31e8e635e954c27d3sa"
      - storage_account_name              = "ccdc31e8e635e954c27d3sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-ARCHIVING-PROD"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c61432c17d56e56ef2b07sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c61432c17d56e56ef2b07sa"
      - storage_account_name              = "c61432c17d56e56ef2b07sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://ccad00eded34a1e94ef76sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-test-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa"
      - storage_account_name              = "ccad00eded34a1e94ef76sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTPTL-INTSVC"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c1baf547074bfbce4b348sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-ptl-rg/providers/Microsoft.Storage/storageAccounts/c1baf547074bfbce4b348sa"
      - storage_account_name              = "c1baf547074bfbce4b348sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c1497c3d7b51d03189ee3sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-ptlsbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa"
      - storage_account_name              = "c1497c3d7b51d03189ee3sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-DACS-SBOX"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c1fe7db01163dd50ba43asa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1fe7db01163dd50ba43asa"
      - storage_account_name              = "c1fe7db01163dd50ba43asa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-DATAINGEST-PROD"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://ce96749381917658e468csa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/ce96749381917658e468csa"
      - storage_account_name              = "ce96749381917658e468csa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.subscription["DTS-DATAINGEST-SBOX"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cdf72bb305eb87473ddb3sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/cdf72bb305eb87473ddb3sa"
      - storage_account_name              = "cdf72bb305eb87473ddb3sa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.subscription["DTS-DATAINGEST-STG"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cda8a21e56bdadf9103f8sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/cda8a21e56bdadf9103f8sa"
      - storage_account_name              = "cda8a21e56bdadf9103f8sa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.subscription["DTS-HERITAGE-EXTSVC-PROD"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://cc170c61a634e27af1597sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cc170c61a634e27af1597sa"
      - storage_account_name              = "cc170c61a634e27af1597sa" -> null
        # (7 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-HERITAGE-EXTSVC-STG"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c9c6048

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rincipal_id                           = "e339f0df-216b-4a51-8d97-29c23490672e" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Platform" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Platform-Prod"] will be destroyed
  # (because key ["Platform-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/c118580e-724c-1724-5681-27b386a07ed0" -> null
      - name                                   = "c118580e-724c-1724-5681-27b386a07ed0" -> null
      - principal_id                           = "38767f90-af2d-4e38-8802-aa92a5e2e327" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Platform-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["SDS"] will be destroyed
  # (because key ["SDS"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/SDS/providers/Microsoft.Authorization/roleAssignments/5434d52b-fdc4-a08f-2a82-baf6662bc01c" -> null
      - name                                   = "5434d52b-fdc4-a08f-2a82-baf6662bc01c" -> null
      - principal_id                           = "7dbd9930-30a1-446b-a2e9-d8bbfa03eec2" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/SDS" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["SDS-Prod"] will be destroyed
  # (because key ["SDS-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/SDS-Prod/providers/Microsoft.Authorization/roleAssignments/b5f8611c-70aa-389e-bb5f-2e7c468b7647" -> null
      - name                                   = "b5f8611c-70aa-389e-bb5f-2e7c468b7647" -> null
      - principal_id                           = "3530a182-04a0-4b49-81a7-579d991b820a" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/SDS-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "47ab87db-5c7b-4b0e-b734-b958f4f566b5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c7d07220-ebc4-4bb2-b165-a1a4a8a69dbd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db9adedb-50d5-4444-91a4-254eeb2b77f1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c9577dce-458b-488b-ab3d-646526c49f9b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0fd61b12-b36f-4ee3-8186-69395e45180f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f9d0f9b0-3f03-4088-ab77-70db4f810816"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e339f0df-216b-4a51-8d97-29c23490672e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "38767f90-af2d-4e38-8802-aa92a5e2e327"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7dbd9930-30a1-446b-a2e9-d8bbfa03eec2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3530a182-04a0-4b49-81a7-579d991b820a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Contributor Role minus deletes"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 20 to add, 58 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":134,"Program":"tfcmt","SHA1":"","Target":"635: prod_enterprise - TerraformPlanApply","Vars":{}} -->